app/controllers/attendees_controller.rb

SELECT "attendees".* FROM "attendees"
SELECT "attendee_logs".* FROM "attendee_logs" WHERE "attendee_logs"."attendee_id" = ?  [["attendee_id", 1]]
SELECT 1 AS one FROM "attendee_logs" WHERE "attendee_logs"."attendee_id" = ? LIMIT ?  [["attendee_id", 3], ["LIMIT", 1]]
---
  def logs
    attendee = Attendee.find_by(id: params[:id])
    if attendee
      logs = attendee.attendee_logs
      if logs.any?