app/controllers/attendees_controller.rb

SELECT "attendees".* FROM "attendees"
---
  def summary

    #params[:event_id] returns the id of the event sent in the URL
    #
    # Params for pagination
    @size = params[:size] || 5
    @page = params[:page] || 1

    puts "THIS IS SIZE: #{params[:size].class} and this is page #{params[:page].class}"

    #when send page and size convert to string

    if params[:size] != nil
      @size = params[:size].to_i
    end

    if params[:page] != nil
      @page = params[:page].to_i
    end


    #with this consult we will find the attendee rules that belongs to that specify event and with the attendee_rules filtered
    #now he have the attendee_rule where we can get  the user_attendee_id for filter by user_attendee_id that belongs to that specific event
    @attendees = Attendee.all

INSERT INTO "attendees" ("user_attendee_id", "ticket_id", "name", "email", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    puts "Total registered attendees: #{total_registered} and the rest of capacity available is: #{(event_capacity - total_registered)}"

    #generating the hash to be included
    all_attendees_for_event << { event_capacity: event_capacity,
                                 attendants: true_attendees,
                                 non_attendants: false_attendees,
                                 tickets_not_sold: (event_capacity-total_registered)