app/controllers/attendees_controller.rb

  def cancel
    attendee = Attendee.find_by(id: params[:id]) # FindAttendeeById
    if attendee.nil?
      render json: { error: 'Attendee not found' }, status: :not_found
      return
    end

    begin
      ActiveRecord::Base.transaction do
        # Update Status and log cancel
        attendee.update!(status: false)

        # Calcel log
        attendee.attendee_logs.create!(
          description: 'Attendee calcel the ticket'
        )
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "attendees" SET "status" = ?, "updated_at" = ? WHERE "attendees"."id" = ?  [["status", 0], ["updated_at", "2024-11-28 20:01:53.603754"], ["id", 1]]
INSERT INTO "attendees" ("user_attendee_id", "ticket_id", "name", "email", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "attendee_logs" ("attendee_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["attendee_id", 1], ["description", "Attendee calcel the ticket"], ["created_at", "2024-11-28 20:01:53.617405"], ["updated_at", "2024-11-28 20:01:53.617405"]]

  def assistants
    # params[:event_id] returns the id of the event sent in the URL

    # with this consult we will find the attendee rules that belongs to that specify event and with the attendee_rules filtered
    # now he have the attendee_rule where we can get  the user_attendee_id for filter by user_attendee_id that belongs to that specific event
    @attendees = Attendee.all
---
SELECT "attendees".* FROM "attendees"

        puts 'Entro al padre'
        if params[:event_id].to_i == ticket[:event_id]
          puts 'EVENTO SIMILARES'
          all_attendees_for_event << attendee
---
INSERT INTO "attendees" ("user_attendee_id", "ticket_id", "name", "email", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def logs
    attendee = Attendee.find_by(id: params[:id])
    if attendee
      logs = attendee.attendee_logs
      if logs.any?
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "attendee_logs".* FROM "attendee_logs" WHERE "attendee_logs"."attendee_id" = ?  [["attendee_id", 1]]
SELECT 1 AS one FROM "attendee_logs" WHERE "attendee_logs"."attendee_id" = ? LIMIT ?  [["attendee_id", 3], ["LIMIT", 1]]

  def create_attendees
    # Crear una instancia del servicio y obtener los tickets
    @events_id = params[:event_id]
    @quantity = params[:quantity]
    @user_attendee = params[:user_attendee_id]
    ticket_service = TicketService.new(@events_id, @quantity)
    result = ticket_service.get_tickets
    puts 'este debe de ser el array de tickets'
    tickets = result[:data]
    # tickets = ticket_service.fetch_tickets
    # tickets = {
    #   'tickets' => [
    #     { 'id' => 14 }
    #   ]
    # }
    begin
      ActiveRecord::Base.transaction do
        tickets_array = tickets['tickets']
        created_attendees = []

        tickets_array.each do |ticket|
          attendee = Attendee.create!(
            user_attendee_id: @user_attendee,
            name: Faker::Name.name,
            email: Faker::Internet.email(domain: 'gmail.com'),
            ticket_id: ticket['id'],
            status: false
          )
---
INSERT INTO "attendees" ("user_attendee_id", "ticket_id", "name", "email", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def confirm
    @attendee = Attendee.find(params[:id])

    if @attendee.update(status: true)
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "attendees" SET "status" = ?, "updated_at" = ? WHERE "attendees"."id" = ?  [["status", 1], ["updated_at", "2024-11-28 17:23:49.855132"], ["id", 10]]