app/controllers/user_attendees_controller.rb

SELECT "user_attendees".* FROM "user_attendees" WHERE "user_attendees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "attendees".* FROM "attendees" WHERE "attendees"."user_attendee_id" = ?  [["user_attendee_id", 1]]
INSERT INTO "attendee_logs" ("attendee_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["attendee_id", 1], ["description", "Cancellation recorded for UserAttendee ID 1: status set to false."], ["created_at", "2024-11-24 06:01:32.574193"], ["updated_at", "2024-11-24 06:01:32.574193"]]
---
  def cancel_attendees
    user_attendee = UserAttendee.find_by(id: params[:id])

    if user_attendee.nil?
      render json: { error: "UserAttendee not found" }, status: :not_found
      return
    end

    begin
      ActiveRecord::Base.transaction do
        # Iterate through associated attendees
        user_attendee.attendees.each do |attendee|
          # Update attendee status to false
          attendee.update!(status: false)

          # Log the cancellation for each attendee with custom or default message
          cancellation_message = params[:description] || "Cancellation recorded for UserAttendee ID #{user_attendee.id}: status set to false."
          attendee.attendee_logs.create!(
            description: cancellation_message
          )

SELECT "user_attendees".* FROM "user_attendees" WHERE "user_attendees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "attendees".* FROM "attendees" WHERE "attendees"."user_attendee_id" = ? AND "attendees"."id" = ? LIMIT ?  [["user_attendee_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "attendee_logs" ("attendee_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["attendee_id", 1], ["description", "Cancellation recorded for UserAttendee ID 1: status set to false."], ["created_at", "2024-11-24 06:10:10.207662"], ["updated_at", "2024-11-24 06:10:10.207662"]]
---
  def cancel_attendee
    user_attendee = UserAttendee.find_by(id: params[:id])

    if user_attendee.nil?
      render json: { error: "UserAttendee not found" }, status: :not_found
      return
    end

    attendee = user_attendee.attendees.find_by(id: params[:attendee_id])

    if attendee.nil?
      render json: { error: "Attendee not found or not belong to UserAttendee" }, status: :not_found
      return
    end

    begin
      ActiveRecord::Base.transaction do
        # Update the specific attendee's status
        attendee.update!(status: false)

        # Log the cancellation for the specific attendee with custom or default message
        cancellation_message = params[:description] || "Cancellation recorded for UserAttendee ID #{user_attendee.id}: status set to false."
          attendee.attendee_logs.create!(
            description: cancellation_message
        )