app/controllers/user_attendees_controller.rb

  def show_user_attendees
    user_attendees = UserAttendee.all
---
SELECT "user_attendees".* FROM "user_attendees"